<?php
    function is_email($email) {
        return preg_match('/^((([0-9A-Za-z]{1}[-0-9A-z\.]{1,}[0-9A-Za-z]{1})|([0-9А-Яа-я]{1}[-0-9А-я\.]{1,}[0-9А-Яа-я]{1}))@([-0-9A-Za-z]{1,}\.){1,2}[-A-Za-z]{2,})$/u', $email)? true : false;
    }

    function is_ipv4($ip) {
        return preg_match('/^(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)$/', $ip);
    }

    function is_ipv6($ip) {
        return preg_match('/^((^|:)([0-9a-fA-F]{0,4})){1,8}&/', $ip);
    }

    function is_ip($ip) {
        return is_ipv4($ip) || is_ipv6($ip);
    }

    function is_sqldate($date) {
        return preg_match('/^(20|\d{1,2})\d{2}(-|\/)((0[1-9])|(1[0-2]))(-|\/)((0[1-9])|([1-2][0-9])|(3[0-1]))((\s)(([0-1][0-9])|(2[0-3])):([0-5][0-9]):([0-5][0-9]))?$/', $date);
    }
?>